netbsdman/netbsd-man-translate/ja/src/share/man/man9/kcopy.9
.\"     $NetBSD: kcopy.9,v 1.5 2006/04/04 20:48:21 wiz Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 2006
.Dt KCOPY 9
.Os
.Sh NAME
.Nm kcopy
.Nd ページフォルトによるアボート中のデータコピー
.Sh SYNOPSIS
.In sys/systm.h
.Ft int
.Fn kcopy "const void *src" "void *dst" "size_t len"
.Sh DESCRIPTION
致命的ページフォルトが発生してアボート中においても、
.Fn kcopy
は
.Fa src
から
.Fa dst
へ
.Fa len
バイト分データコピーする。
.Pp
.Xr uiomove 9
によって引き起こされた(古い)ページフォルトハンドラを
.Fn kcopy
は保存/復元をしなければならない。なぜなら致命的でない通常のページフォルトの
処理中のであるかもしれないから。
.Fn kcopy
は成功すると0を返し、失敗するとエラー番号を返す。
.Sh SEE ALSO
.Xr errno 2 ,
.Xr memcpy 9 ,
.Xr uiomove 9
