netbsdman/netbsd-man-translate/translated/src/share/man/ja/man9/log.9
.\"     $NetBSD: log.9,v 1.9 2003/04/16 13:35:30 wiz Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Michael Graff.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.Dd May 12, 1997
.Dt LOG 9
.Os
.Sh NAME
.Nm log
.Nd カーネルからのメッセージログを
.Pa /dev/klog
デバイスを通して取得
.Sh SYNOPSIS
.In sys/syslog.h
.Ft void
.Fo "log"
.Fa "int level"
.Fa "const char *format"
.Fa "..."
.Fc
.Sh DESCRIPTION
.Fn log
をカーネルが使うことで、
.Pa /dev/klog
を監視しているユーザプロセスにメッセージを送る。
通例
.Xr syslogd 8
は
.Pa /dev/klog
を監視していて、
これらのメッセージをログファイルに書き込む。
.Pp
すべてのログメッセージにはログレベル
.Dv LOG_KERN
が適用される。
ログレベルについての詳細は
.Xr syslog 3
を参照。
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr syslogd 8
